test/deepseek_v3.2-results-1218/converted_results/sglang_baseline_random_128.txt
============ Serving Benchmark Result ============
Successful requests:                     1000
Benchmark duration (s):                  10.19
Total input tokens:                      128000
Total generated tokens:                  4000
Request throughput (req/s):              98.11
Output token throughput (tok/s):         392.45
Peak output token throughput (tok/s):    1858.00
Peak concurrent requests:                1000.00
Total Token throughput (tok/s):          12950.73
---------------Time to First Token----------------
Mean TTFT (ms):                          5858.41
Median TTFT (ms):                        5674.08
P99 TTFT (ms):                           8468.16
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          1185.57
Median TPOT (ms):                        1287.58
P99 TPOT (ms):                           2146.50
---------------Inter-token Latency----------------
Mean ITL (ms):                           711.34
Median ITL (ms):                         219.47
P99 ITL (ms):                            5362.08
==================================================